Revit 2027 API
UIView.GetZoomCorners Method
 Gets the corners of the view's rectangle. The two points that define the corners of the view's rectangle in model coordinates.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<XYZ> GetZoomCorners()
Public Function GetZoomCorners As IList(Of XYZ)
public:
IList<XYZ^>^ GetZoomCorners()
member GetZoomCorners : unit -> IList<XYZ>
Return Value
IList<XYZ>
See Also
Reference
UIView Class
Autodesk.Revit.UI Namespace